tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1; //10;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

functions
{
    forceDisp1
    {
        type          solidForcesDisplacements;
        historyPatch  right;
    }
}

// ************************************************************************* //
