tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/constant/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

mechanical
(
    steel
    {
        type            linearElastic;
        rho             rho [1 -3 0 0 0 0 0] 7854;
        E               E [1 -1 -2 0 0 0 0] 200e+9;
        nu              nu [0 0 0 0 0 0 0] 0.3;
    }
    // carbonFibre
    // {
    //     type            orthotropicLinearElastic;
    //     rho             rho [1 -3 0 0 0 0 0] 7854;
    //     E1              E1 [1 -1 -2 0 0 0 0] 50e+9;
    //     E2              E2 [1 -1 -2 0 0 0 0] 5e+9;
    //     E3              E3 [1 -1 -2 0 0 0 0] 50e+9;
    //     nu12            nu12 [0 0 0 0 0 0 0] 0.3;
    //     nu23            nu23 [0 0 0 0 0 0 0] 0.03;
    //     nu31            nu31 [0 0 0 0 0 0 0] 0.3;
    //     G12             G12 [1 -1 -2 0 0 0 0] 5e+9;
    //     G23             G23 [1 -1 -2 0 0 0 0] 5e+9;
    //     G31             G31 [1 -1 -2 0 0 0 0] 19.23e+9;
    //     //materialDirection1 (1 0 0);
    //     //materialDirection2 (0 1 0);
    //     //materialDirection3 (0 0 1);
    // }
);

// ************************************************************************* //
