tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/constant/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// linearGeometry: assumes small strains and rotations
/*solidModel     linearGeometryTotalDisplacement;*/
/*solidModel     linGeomVelocitySolid;*/
solidModel     linGeomPressureVelocitySolid;
//solidModel     unsLinearGeometry;

"linearGeometryTotalDisplacementCoeffs|linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs1|velocitySolidCoeffs|linGeomVelocitySolidCoeffs|linGeomPressureVelocitySolidCoeffs"
{
    // Maximum number of momentum correctors
    nCorrectors     200;
    nInnerCorrectors 1;
    pRefCell        0;
    pRefValue       0;
    // Solution tolerance for displacement
    solutionTolerance 1e-06;

    // Alternative solution tolerance for displacement
    alternativeTolerance 1e-07;

    // Material law solution tolerance
    materialTolerance 1e-05;

    // Write frequency for the residuals
    infoFrequency   100;
}


// ************************************************************************* //
