tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/constant/timeVsTraction
(
    ( 0    ( 0 0 0 ) )
    ( 10   ( 1e6 0 0 ) )
)
