tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            symmetryPlane;
/*        patchType       symmetryPlane;*/
/*        value           uniform (0 0 0);*/
    }
    right
    {
        //type            zeroGradient;
        type            extrapolatedPressure;
        //type            fixedValue;
        //value           uniform 0;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        //type            fixedValue;
        //value           uniform 0;
        type            extrapolatedPressure;
        // value           uniform 0;
        //type           zeroGradient;
    }
    hole
    {
        //type            fixedValue;
        //value           uniform 0;
        type            extrapolatedPressure;
        //value           uniform 0;
        //type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
