tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    D
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-09;
        relTol          0.1;
    }


    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
/*        solver          PCG;*/
/*        preconditioner  FDIC;*/
        tolerance       1e-12;
        relTol          0; //0.1;
    }
    p
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }

}

relaxationFactors
{
    // Under-relaxating the D equation by 0.99-0.9999 can improve convergence in
    // some cases, in particular when there are solidContact boundaries
    equations
    {
        //D    0.999;
        //U      0.7;
        p      0.3;
    }

    // Under-relaxating the D field by 0.1-0.9 can improve convergence in some
    // cases
    fields
    {
        //p      0.1;
        //D      0.7;
        //U        0.1;
    }
}

// ************************************************************************* //
