tutorials/solids/linearElasticity/plateHole/plateHolePressureVelocity/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication solids4Foam

# ----------------------------------------------------------------- end-of-file

